// Всі функції повинні бути описані стрілочним типом!!!!

//     - створити функцію яка обчислює та повертає площу прямокутника
// const squareRectangle = (a, b) => {
//     return a * b;
// }
// document.write(squareRectangle(5, 4));

// - створити функцію яка обчислює та повертає площу кола
// const squareCircle = (r) => {
//     return 2 * 3.14 * r;
//     ;
// }
// document.write(squareCircle(5));

// - створити функцію яка обчислює та повертає площу циліндру
// const squareCylinder = (r, h) => {
//     return (2 * 3.14 * r * h) + (2 * 3.14 * r * r) ;
// }
// document.write(squareCylinder(5, 4));

// - створити функцію яка приймає масив та виводить кожен його елемент
// - створити функцію яка  створює параграф з текстом. Текст задати через аргумент
// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
//
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
