// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
//  Потрібно зробити перевірку якщо кількість елементів у масиві більше або дорівнює 3,
//  то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//  Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// friends.length >= 3 ? alert('цей масив великий') : alert('цей масив малий,в ньому менше 3-ох елементів');

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//   Знайти, яке з них є середнім (більше одного, але менше за інше).
//   Перевірити, чи знаходиться перше число між двома іншими.

// let a = 6;
// let b = 9;
// let c = 2;
// if (a > b && a < c || a < b && a > c) {
//     alert('a посередині')
// } else if (b > a && b < c || b < a && b > c) {
//     alert('b посередині')
// } else if (c > a && c < b || c < a && c > b) {
//     alert('c посередині')
// } else {
//     alert('числа рівні')
// }


// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
//   if (a + b < 4) {
//     result = 'Мало';
//   } else {
//     result = 'Багато';
//   }

// let result;
// let a = 1;
// let b = 1;
// (a + b < 4) ? result = 'мало' : result = 'багато';
// alert(result);

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним,
//   негативним або нулем.Напишіть це тернарним оператором

// let num = -60;
//     num === 0 ? alert('нуль') :
//         (num >= -100 && num < 0) ? alert('негативне') :
//             (num > 0 && num <= 100) ? alert('позитивне'):
//                 alert('ви ввели число,яке не входить в цей діапазон');
