//- Користувач вводить або має два числа.
// Потрібно знайти та вивести максимальне число з тих двох .
// Також потрібно врахувати коли введені рівні числа.

// let a = +prompt('Enter 1st number');
// let b = +prompt('Enter 2nd number');
// if (a > b) {
//     alert(a)
// } else if (a < b) {
//     alert(b)
// } else {
//     alert('numbers are equal')
// }

// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let address = 101;
// if (address >= 1 && address <= 20) {
//     alert('1 підїзд')
// } else if (address >= 21 && address <= 48) {
//     alert('2 підїзд')
// } else if (address >= 49 && address <= 90) {
//     alert('3 підїзд')
// } else {
//     alert('Немає такої квартири')
// }


//- Ми маємо змінну number в яку користувач задає числове значення,
// якщо змінна рівна 10 вивести повідомлення ВІРНО,
// якщо змінна не рівна 10 - тоді НЕВІРНО

// let number = +prompt('Enter the number');
// (number === 10) ? alert('ВІРНО') : alert('НЕВІРНО');


// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22, вивести повідомлення, що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let temp = +prompt('Яка температура?');
// if (temp >= 10 && temp <= 22) {
//     alert('Йдемо вчитися')
// } else {
//     alert('Вчимося онлайн')
// }

//- За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5.
// І взалежності від введеного числа нам дається приз. (Авто, Мото, Телефон, і т.д )
// і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

// let loto = +prompt('Введіть число від 1 до 5 ');
// switch (loto) {
//     case 1:
//         alert('Ви виграли Автомобіль!');
//         break;
//     case 2:
//         alert('Ви виграли IPhone!');
//         break;
//     case 3:
//         alert('Ви виграли електросамокат!');
//         break;
//     case 4:
//         alert('Ви виграли Холодильник!');
//         break;
//     case 5:
//         alert('Ви виграли Хеллоу Кітті!');
//         break;
//     default:
//         alert('Ви ввели не те число,спробуйте ще раз');
// }